app/Controllers/Home.php

SELECT *
FROM `receta`
ORDER BY `cant_likes` DESC
 LIMIT 6
---
    private function obtenerRankingRecetas($limite = 6)
    {
        $recetaModel = new RecetaModel();

        return $recetaModel
            ->orderBy('cant_likes', 'DESC')
            ->findAll($limite);

SELECT `resena`.*, `receta`.`titulo_receta`, `receta`.`id_receta`
FROM `resena`
JOIN `receta` ON `receta`.`id_receta` = `resena`.`id_receta`
ORDER BY `cant_likes` DESC
 LIMIT 3
---
    private function obtenerRankingResenas($limite = 3)
    {
        $resenaModel = new ResenaModel();

        return $resenaModel
            ->select('resena.*, receta.titulo_receta, receta.id_receta')
            ->join('receta', 'receta.id_receta = resena.id_receta')
            ->orderBy('cant_likes', 'DESC')
            ->findAll($limite);

SELECT *
FROM `receta`
ORDER BY `id_receta` DESC
 LIMIT 6
---
    private function obtenerRecetasRecientes($limite = 6)
    {
        $recetaModel = new RecetaModel();

        return $recetaModel
            ->orderBy('id_receta', 'DESC')
            ->findAll($limite);