app/Controllers/Ingrediente.php

SELECT *
FROM `ingrediente`
WHERE `nombre_ingrediente` = 'harina'
 LIMIT 1
---
public function obtenerIngrediente($nombre)
{
    $model = new IngredienteModel();

    $ingrediente = $model
        ->where(
            'nombre_ingrediente',
            $nombre
        )
        ->first();

INSERT INTO `ingrediente` (`nombre_ingrediente`) VALUES ('harina')
---
private  function registrarIngrediente($nombre)
{
    $model = new IngredienteModel();

    $model->insert([
        'nombre_ingrediente' => $nombre
    ]);