app/Controllers/Receta.php

    public  function obtenerRecetasRecientes($limite )
    {
        $recetaModel = new RecetaModel();

        return $recetaModel
            ->orderBy('id_receta', 'DESC')
            ->findAll($limite);
---
SELECT *
FROM `receta`
WHERE `receta`.`id_receta` = '6'

private function registrarReceta(
    $titulo,
    $descripcion,
    $idCategoria,
    $imagen
)
{
    $model = new RecetaModel();

    $nombreImagen = $imagen->getRandomName();

    $imagen->move(
        'assets/uploads/',
        $nombreImagen
    );

    $model->insert([
        'titulo_receta'      => $titulo,
        'descripcion_receta' => $descripcion,
        'imagen_receta'      => $nombreImagen,
        'id_usuario'         => session()->get('id_usuario'),
        'id_categoria'       => $idCategoria
    ]);
---
SELECT *
FROM `categoria`
WHERE `id_categoria` = '1'
SELECT *
FROM `receta`

public function registrarIngredienteReceta(
    $idReceta,
    $idIngrediente
)
{
    $relacionModel = new RecetaIngredienteModel();

    $relacionModel->insert([
        'id_receta'      => $idReceta,
        'id_ingrediente' => $idIngrediente
    ]);
---
INSERT INTO `receta_ingrediente` (`id_receta`, `id_ingrediente`) VALUES (32, 61)