app/Controllers/Receta.php

private function obtenerIngredientes($idReceta)
{
    $db = \Config\Database::connect();

    return $db->table('receta_ingrediente ri')
        ->select('i.nombre_ingrediente')
        ->join('ingrediente i', 'i.id_ingrediente = ri.id_ingrediente')
        ->where('ri.id_receta', $idReceta)
        ->get()
        ->getResultArray();
---
SELECT `i`.`nombre_ingrediente`
FROM `receta_ingrediente` `ri`
JOIN `ingrediente` `i` ON `i`.`id_ingrediente` = `ri`.`id_ingrediente`
WHERE `ri`.`id_receta` = '8'

private function obtenerResenas($idReceta)
{
    $db = \Config\Database::connect();

    return $db->table('resena r')
        ->select('r.*, u.nombre_usuario')
        ->join('usuario u', 'u.id_usuario = r.id_usuario')
        ->where('r.id_receta', $idReceta)
        ->orderBy('r.fecha_resena', 'DESC')
        ->get()
        ->getResultArray();
---
SELECT `r`.*, `u`.`nombre_usuario`
FROM `resena` `r`
JOIN `usuario` `u` ON `u`.`id_usuario` = `r`.`id_usuario`
WHERE `r`.`id_receta` = '8'
ORDER BY `r`.`fecha_resena` DESC

private function usuarioYaComento($idReceta) {
     if (!session()->get('isLoggedIn')) { return false; } $resenaModel = new ResenaModel();
     return $resenaModel
     ->where([ 'id_usuario' => session()
     ->get('id_usuario'), 'id_receta' => $idReceta ])
     ->first(); }
---
SELECT *
FROM `resena`
WHERE `id_usuario` = '1'
AND `id_receta` = '8'
 LIMIT 1