app/Controllers/Receta.php

    private function obtenerRankingRecetas($limite = 6)
    {
        $recetaModel = new RecetaModel();

        return $recetaModel
            ->orderBy('cant_likes', 'DESC')
            ->findAll($limite);
---
SELECT *
FROM `receta`
ORDER BY `cant_likes` DESC
 LIMIT 6

    private function obtenerRankingResenas($limite = 3)
    {
        $resenaModel = new ResenaModel();

        return $resenaModel
            ->select('resena.*, receta.titulo_receta, receta.id_receta')
            ->join('receta', 'receta.id_receta = resena.id_receta')
            ->orderBy('cant_likes', 'DESC')
            ->findAll($limite);
---
SELECT `resena`.*, `receta`.`titulo_receta`, `receta`.`id_receta`
FROM `resena`
JOIN `receta` ON `receta`.`id_receta` = `resena`.`id_receta`
ORDER BY `cant_likes` DESC
 LIMIT 3

    private function obtenerRecetasRecientes($limite = 6)
    {
        $recetaModel = new RecetaModel();

        return $recetaModel
            ->orderBy('id_receta', 'DESC')
            ->findAll($limite);
---
SELECT *
FROM `receta`
ORDER BY `id_receta` DESC
 LIMIT 6

private function obtenerIngredientes($idReceta)
{
    $db = \Config\Database::connect();

    return $db->table('receta_ingrediente ri')
        ->select('i.nombre_ingrediente')
        ->join('ingrediente i', 'i.id_ingrediente = ri.id_ingrediente')
        ->where('ri.id_receta', $idReceta)
        ->get()
        ->getResultArray();
---
SELECT `i`.`nombre_ingrediente`
FROM `receta_ingrediente` `ri`
JOIN `ingrediente` `i` ON `i`.`id_ingrediente` = `ri`.`id_ingrediente`
WHERE `ri`.`id_receta` = '5'

private function registrarReceta($titulo, $descripcion, $ingredientes, $idCategoria, $imagen)
{
    $model = new RecetaModel();

    $nombreImagen = $imagen->getRandomName();
    $imagen->move('assets/uploads/', $nombreImagen);

    $model->insert([
        'titulo_receta' => $titulo,
        'descripcion_receta' => $descripcion,
        'imagen_receta' => $nombreImagen,
        'id_usuario' => session()->get('id_usuario'),
        'id_categoria' => $idCategoria
    ]);
---
SELECT *
FROM `categoria`
SELECT *
FROM `receta`
WHERE `id_categoria` = '4'

    private function obtenerTodasLasCategorias()
    {
        $categoriaModel = new CategoriaModel();

        return $categoriaModel->findAll();
---
SELECT *
FROM `categoria`

    private function obtenerTopRecetasDeCategoria($idCategoria, $limite)
    {
        $recetaModel = new RecetaModel();

        return $recetaModel
            ->where('id_categoria', $idCategoria)
            ->orderBy('cant_likes', 'DESC')
            ->findAll($limite);
---
SELECT *
FROM `receta`
WHERE `id_categoria` = '1'
ORDER BY `cant_likes` DESC
 LIMIT 10