app/Controllers/Resena.php

SELECT `r`.*, `u`.`nombre_usuario`
FROM `resena` `r`
JOIN `usuario` `u` ON `u`.`id_usuario` = `r`.`id_usuario`
WHERE `r`.`id_receta` = '5'
ORDER BY `r`.`fecha_resena` DESC
---
    public  function obtenerResenas($idReceta)
{
    $db = \Config\Database::connect();

    return $db->table('resena r')
        ->select('r.*, u.nombre_usuario')
        ->join('usuario u', 'u.id_usuario = r.id_usuario')
        ->where('r.id_receta', $idReceta)
        ->orderBy('r.fecha_resena', 'DESC')
        ->get()
        ->getResultArray();

SELECT *
FROM `resena`
WHERE `id_usuario` = '1'
AND `id_receta` = '5'
 LIMIT 1
---
public  function usuarioYaComento($idReceta) {
     if (!session()->get('isLoggedIn')) { return false; } $resenaModel = new ResenaModel();
     return $resenaModel
     ->where([ 'id_usuario' => session()
     ->get('id_usuario'), 'id_receta' => $idReceta ])
     ->first(); }

SELECT `resena`.*, `receta`.`titulo_receta`, `receta`.`id_receta`
FROM `resena`
JOIN `receta` ON `receta`.`id_receta` = `resena`.`id_receta`
ORDER BY `cant_likes` DESC
 LIMIT 3
---
    public function obtenerRankingResenas($limite = 3)
    {
        $resenaModel = new ResenaModel();

        return $resenaModel
            ->select('resena.*, receta.titulo_receta, receta.id_receta')
            ->join('receta', 'receta.id_receta = resena.id_receta')
            ->orderBy('cant_likes', 'DESC')
            ->findAll($limite);