app/Controllers/Usuario.php

INSERT INTO `usuario` (`nombre_usuario`, `correo_usuario`, `password_usuario`, `rol_usuario`) VALUES ('joa', 'joa@gmail.com', '$2y$10$j3hdxx6xAqmPtXacpKveDeWEiLfpuaMw6go2RT55BcG7OST8w6dFe', 2)
---
    public function guardar()
    {
        // conecta al modelo
        $model = new UsuarioModel();


        $datos = [
            'nombre_usuario'   => $this->request->getPost('nombre'),
            'correo_usuario'   => $this->request->getPost('correo'),
            'password_usuario' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'rol_usuario'      => 2
        ];


        $model->insert($datos);

SELECT *
FROM `usuario`
WHERE `correo_usuario` = 'joa@gmail.com'
 LIMIT 1
---
    public function procesarLogin()
    {
        $session = session();
        $model = new UsuarioModel();

        $correo = $this->request->getPost('correo');
        $password = $this->request->getPost('password');


        $usuario = $model->where('correo_usuario', $correo)->first();