app/Controllers/VotoReceta.php

private function verificarVotoUsuario(
    $idUsuario,
    $idReceta,
    $tipoVoto
)
{
    $votoModel = new VotoRecetaModel();

    $votoExistente = $votoModel
        ->where([
            'id_usuario' => $idUsuario,
            'id_receta'  => $idReceta
        ])
        ->first();
---
SELECT *
FROM `voto_receta`
WHERE `id_usuario` = '1'
AND `id_receta` = '4'
 LIMIT 1

private function guardarVoto(
    $idUsuario,
    $idReceta,
    $tipoVoto,
    $votoExistente
)
{
    $votoModel = new VotoRecetaModel();

    if ($votoExistente) {

        $votoModel
            ->where('id_usuario', $idUsuario)
            ->where('id_receta', $idReceta)
            ->set([
                'tipo_voto' => $tipoVoto
            ])
            ->update();

    } else {

        $votoModel->insert([
            'id_usuario' => $idUsuario,
            'id_receta'  => $idReceta,
            'tipo_voto'  => $tipoVoto
        ]);
---
INSERT INTO `voto_receta` (`id_usuario`, `id_receta`, `tipo_voto`) VALUES ('1', '4', '1')