app/Models/IngredienteModel.php

    public function obtenerIngredientesReceta($idReceta)
    {
        return $this->db
            ->table('receta_ingrediente ri')
            ->select('i.nombre_ingrediente')
            ->join(
                'ingrediente i',
                'i.id_ingrediente = ri.id_ingrediente'
            )
            ->where('ri.id_receta', $idReceta)
            ->get()
            ->getResultArray();
---
SELECT `i`.`nombre_ingrediente`
FROM `receta_ingrediente` `ri`
JOIN `ingrediente` `i` ON `i`.`id_ingrediente` = `ri`.`id_ingrediente`
WHERE `ri`.`id_receta` = '8'