app/Models/ResenaModel.php

SELECT `r`.*, `u`.`nombre_usuario`
FROM `resena` `r`
JOIN `usuario` `u` ON `u`.`id_usuario` = `r`.`id_usuario`
WHERE `r`.`id_receta` = '8'
ORDER BY `r`.`fecha_resena` DESC
---
public function obtenerResenas($idReceta)
{
    return $this->db->table('resena r')
        ->select('r.*, u.nombre_usuario')
        ->join('usuario u', 'u.id_usuario = r.id_usuario')
        ->where('r.id_receta', $idReceta)
        ->orderBy('r.fecha_resena', 'DESC')
        ->get()
        ->getResultArray();