app/Models/VotoRecetaModel.php

SELECT COUNT(*) AS `numrows`
FROM `voto_receta`
WHERE `id_receta` = '4'
AND `tipo_voto` = 1
---
    public function contarVotos($idReceta, $tipo)
    {
        return $this->where([
            'id_receta' => $idReceta,
            'tipo_voto' => $tipo
        ])->countAllResults();